# Max Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxXYZ..::..Max Property
BoundingBoxXYZ Class See Also
---
Maximum coordinates (upper-right-front corner of the box).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Max { get; set; }
```

Visual Basic
---
```text
Public Property Max As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ Max {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
The bounds are defined in the coordinate space of the box.
# See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace